Revit 2026 API

# ICentralLockedCallback Methods

---

The ICentralLockedCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShouldWaitForLockAvailability | Returns whether Revit should wait and try again to acquire the lock on central. |

#### Reference

ICentralLockedCallback Interface

Autodesk.Revit.DB Namespace